eziya/STM32_SECURITY_LAB/MOOC_DOCS/Part6/STM32CubeExpansion_SBSFU_V2.6.1/Projects/STM32F413H-Discovery/Applications/1_Image/1_Image_SBSFU/SBSFU/Target/sfu_low_level_security.c
/**
  ******************************************************************************
  * @file    sfu_low_level_security.c
  * @author  MCD Application Team
  * @brief   SFU Security Low Level Interface module
  *          This file provides set of firmware functions to manage SFU security
  *          low level interface.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file in
  * the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "sfu_low_level_security.h"
#include "sfu_low_level_flash_int.h"
#include "sfu_low_level.h"
#include "sfu_trace.h"
#include "sfu_boot.h"
#include "sfu_fsm_states.h" /* needed for sfu_error.h */
#include "sfu_error.h"
#include "sfu_standalone_loader.h"
#include "stm32f4xx_it.h"
#include "sfu_mpu_isolation.h"        /* Secure Engine isolated thanks to MPU */

#ifndef  SFU_WRP_PROTECT_ENABLE
#warning "SFU_WRP_PROTECT_DISABLED"
#endif /* SFU_WRP_PROTECT_ENABLE */

#ifndef  SFU_RDP_PROTECT_ENABLE
#warning "SFU_RDP_PROTECT_DISABLED"
#endif /* SFU_RDP_PROTECT_ENABLE */


#ifndef  SFU_MPU_PROTECT_ENABLE
#warning "SFU_MPU_PROTECT_DISABLED"
#endif /* SFU_MPU_PROTECT_ENABLE */



#ifndef  SFU_TAMPER_PROTECT_ENABLE
#warning "SFU_TAMPER_PROTECT_DISABLED"
#endif /* SFU_TAMPER_PROTECT_ENABLE */

#ifndef  SFU_DAP_PROTECT_ENABLE
#warning "SFU_DAP_PROTECT_DISABLED"
#endif /* SFU_DAP_PROTECT_ENABLE */

#ifndef  SFU_DMA_PROTECT_ENABLE
#warning "SFU_DMA_PROTECT_DISABLED"
#endif /* SFU_DMA_PROTECT_ENABLE */

#ifndef  SFU_IWDG_PROTECT_ENABLE
#warning "SFU_IWDG_PROTECT_DISABLED"
#endif /* SFU_IWDG_PROTECT_ENABLE */


/* Private typedef -----------------------------------------------------------*/
typedef enum
{
  SFU_FALSE = 0U,
  SFU_TRUE = !SFU_FALSE
} SFU_BoolTypeDef;

typedef struct
{
  uint8_t                Number;            /*!< Specifies the number of the region to protect. This parameter can be a
                                                 value of CORTEX_MPU_Region_Number */
  uint32_t               BaseAddress;       /*!< Specifies the base address of the region to protect. */
  uint8_t                Size;              /*!< Specifies the size of the region to protect. */
  uint8_t                AccessPermission;  /*!< Specifies the region access permission type. This parameter can be a
                                                 value of CORTEX_MPU_Region_Permission_Attributes */
  uint8_t                DisableExec;       /*!< Specifies the instruction access status. This parameter can be a value
                                                 of  CORTEX_MPU_Instruction_Access */
  uint8_t                SubRegionDisable;  /*!< Specifies the sub region field (region is divided in 8 slices) when bit
                                                 is 1 region sub region is disabled */
  uint8_t                Tex;               /*!< Specifies the tex value  */
  uint8_t                Cacheable;         /*!< Specifies the cacheable value  */
  uint8_t                Bufferable;        /*!< Specifies the cacheable value  */
} SFU_MPU_InitTypeDef;

typedef uint32_t      SFU_ProtectionTypeDef;  /*!<   SFU HAL IF Protection Type Def*/

/* Private variables ---------------------------------------------------------*/
#ifdef  SFU_IWDG_PROTECT_ENABLE
static IWDG_HandleTypeDef   IwdgHandle;

#endif /* SFU_IWDG_PROTECT_ENABLE */
#ifdef  SFU_MPU_PROTECT_ENABLE
static SFU_MPU_InitTypeDef MpuAreas[] =

{
  /*  se execution */
  {
    SFU_PROTECT_MPU_EXEC_SE_RGNV, SFU_PROTECT_MPU_EXEC_SE_START, SFU_PROTECT_MPU_EXEC_SE_SIZE,
    SFU_PROTECT_MPU_EXEC_SE_PERM, SFU_PROTECT_MPU_EXEC_SE_EXECV, SFU_PROTECT_MPU_EXEC_SE_SREG,
    SFU_PROTECT_MPU_EXEC_SE_TEXV, SFU_PROTECT_MPU_EXEC_SE_C, SFU_PROTECT_MPU_EXEC_SE_B
  },

  /* se ram  */
  {
    SFU_PROTECT_MPU_SRAM_SE_RGNV, SFU_PROTECT_MPU_SRAM_SE_START, SFU_PROTECT_MPU_SRAM_SE_SIZE,
    SFU_PROTECT_MPU_SRAM_SE_PERM, SFU_PROTECT_MPU_SRAM_SE_EXECV, SFU_PROTECT_MPU_SRAM_SE_SREG,
    SFU_PROTECT_MPU_SRAM_SE_TEXV, SFU_PROTECT_MPU_SRAM_SE_C, SFU_PROTECT_MPU_SRAM_SE_B
  },

  /* SRAM access */
  {
    SFU_PROTECT_MPU_SRAMACC_RGNV, SFU_PROTECT_MPU_SRAMACC_START, SFU_PROTECT_MPU_SRAMACC_SIZE,
    SFU_PROTECT_MPU_SRAMACC_PERM, SFU_PROTECT_MPU_SRAMACC_EXECV, SFU_PROTECT_MPU_SRAMACC_SREG,
    SFU_PROTECT_MPU_SRAMACC_TEXV, SFU_PROTECT_MPU_SRAMACC_C, SFU_PROTECT_MPU_SRAMACC_B
  },

  /* install header : read /write only for privileged */
  {
    SFU_PROTECT_MPU_HEADER_RGNV, SFU_PROTECT_MPU_HEADER_START, SFU_PROTECT_MPU_HEADER_SIZE,
    SFU_PROTECT_MPU_HEADER_PERM, SFU_PROTECT_MPU_HEADER_EXECV, SFU_PROTECT_MPU_HEADER_SREG,
    SFU_PROTECT_MPU_HEADER_TEXV, SFU_PROTECT_MPU_HEADER_C, SFU_PROTECT_MPU_HEADER_B
  },

  /*  Flash execution */
  {
    SFU_PROTECT_MPU_FLASHEXE_RGNV, SFU_PROTECT_MPU_FLASHEXE_START, SFU_PROTECT_MPU_FLASHEXE_SIZE,
    SFU_PROTECT_MPU_FLASHEXE_PERM, SFU_PROTECT_MPU_FLASHEXE_EXECV, SFU_PROTECT_MPU_FLASHEXE_SREG,
    SFU_PROTECT_MPU_FLASHEXE_TEXV, SFU_PROTECT_MPU_FLASHEXE_C, SFU_PROTECT_MPU_FLASHEXE_B
  },
  /*  Flash access for read write, slot  , swap */
  {
    SFU_PROTECT_MPU_FLASHACC_RGNV, SFU_PROTECT_MPU_FLASHACC_START, SFU_PROTECT_MPU_FLASHACC_SIZE,
    SFU_PROTECT_MPU_FLASHACC_PERM, SFU_PROTECT_MPU_FLASHACC_EXECV, SFU_PROTECT_MPU_FLASHACC_SREG,
    SFU_PROTECT_MPU_FLASHACC_TEXV, SFU_PROTECT_MPU_FLASHACC_C, SFU_PROTECT_MPU_FLASHACC_B
  },
  /*  peripheral  */
  {
    SFU_PROTECT_MPU_PERIPH_1_RGNV, SFU_PROTECT_MPU_PERIPH_1_START, SFU_PROTECT_MPU_PERIPH_1_SIZE,
    SFU_PROTECT_MPU_PERIPH_1_PERM, SFU_PROTECT_MPU_PERIPH_1_EXECV, SFU_PROTECT_MPU_PERIPH_1_SREG,
    SFU_PROTECT_MPU_PERIPH_1_TEXV, SFU_PROTECT_MPU_PERIPH_1_C, SFU_PROTECT_MPU_PERIPH_1_B
  },
  {
    SFU_PROTECT_MPU_PERIPH_2_RGNV, SFU_PROTECT_MPU_PERIPH_2_START, SFU_PROTECT_MPU_PERIPH_2_SIZE,
    SFU_PROTECT_MPU_PERIPH_2_PERM, SFU_PROTECT_MPU_PERIPH_2_EXECV, SFU_PROTECT_MPU_PERIPH_2_SREG,
    SFU_PROTECT_MPU_PERIPH_2_TEXV, SFU_PROTECT_MPU_PERIPH_2_C, SFU_PROTECT_MPU_PERIPH_2_B
  }
};
#endif /* SFU_MPU_PROTECT_ENABLE */

